# SetFillGrid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern..::..SetFillGrid Method
FillPattern Class See Also
---
Sets the fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetFillGrid(
	int gridIdx,
	FillGrid fillGrid
)
```

Visual Basic
---
```text
Public Sub SetFillGrid ( _
	gridIdx As Integer, _
	fillGrid As FillGrid _
)
```

Visual C++
---
```text
public:
void SetFillGrid(
	int gridIdx,
	FillGrid^ fillGrid
)
```

# ### Parameters
gridIdx
    Type: System..::..Int32 The index of the fill grid.
fillGrid
    Type: Autodesk.Revit.DB..::..FillGrid The fill grid to be used.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FillPattern Class
Autodesk.Revit.DB Namespace